<?php

return [

    'layouts' => [
        'hc' => 'Управляющая компания',
        'main' => 'Главная',
        'admin' => 'Админ',
        'dashboard' => 'Панель управления',
        'chat' => 'Чат',
        'forum' => 'Форум',
        'info' => 'Инфо',
    ],

    'auth' => [
        'login' => 'Войти',
        'logout' => 'Выйти',
        'forgot_password' => 'Забыли пароль?',
        'register' => 'Регистрация',
        'confirm_password' => 'Подтвердите пароль',
        'confirm_password_text' => 'Это защищённая зона. Пожалуйста, подтвердите пароль перед продолжением.',
        'confirm_password_text2' => 'Введите ваш e-mail, и мы отправим ссылку для сброса пароля.',
        'reset_password' => 'Сбросить пароль',
        'verify_email_text1' => "Спасибо за регистрацию! Проверьте почту для подтверждения учётной записи.\nЕсли письмо не пришло, вы можете запросить новое.",
        'verify_email_text2' => 'Новая ссылка для подтверждения была отправлена на вашу электронную почту.',
    ],

    'buttons' => [
        'login' => 'Войти',
        'confirm' => 'Подтвердить',
        'send_reset_link' => 'Отправить ссылку для сброса',
        'register' => 'Зарегистрироваться',
        'reset_password' => 'Сбросить пароль',
        'resend_verification_email' => 'Отправить письмо повторно',
    ],

    'inputs' => [
        'email' => 'Электронная почта',
        'password' => 'Пароль',
        'first_name' => 'Имя',
        'second_name' => 'Фамилия',
        'confirm_password' => 'Подтверждение пароля',
        'phone' => 'Телефон',
        'new_password' => 'Новый пароль',
        'confirm_new_password' => 'Подтвердите новый пароль',
    ],

    'components' => [
        'logout' => 'Выйти',
        'login' => 'Войти',
        'light_mode' => 'Светлая тема',
        'dark_mode' => 'Тёмная тема',
    ],

    'companies' => [
        'my_companies' => 'Мои компании',
    ],

    'pages' => [
        'chat' => 'Чат',
        'chat_text1' => "Здесь будет доступен чат в реальном времени для участников компании.\n(Модуль чата находится в разработке)",
        'user_dashboard' => 'Панель пользователя',
        'forum' => 'Форум',
        'forum_text1' => "В этом разделе будут обсуждения и вопросы-ответы между пользователями\n(страница в разработке)",
        'info_text1' => 'О проекте Housing Company',
        'info_text2' => "Это PET-проект для управления товариществами собственников жилья.\nПроект позволяет жителям и администраторам управлять постами,\nпользователями и информацией о компании в одном месте.",
        'admin_panel' => 'Админ-панель',
    ],

];
