<?php

return [

    'layouts' => [
        'hc' => 'Керуюча компанія',
        'main' => 'Головна',
        'admin' => 'Адмін',
        'dashboard' => 'Панель',
        'chat' => 'Чат',
        'forum' => 'Форум',
        'info' => 'Інфо',
    ],

    'auth' => [
        'login' => 'Увійти',
        'logout' => 'Вийти',
        'forgot_password' => 'Забули пароль?',
        'register' => 'Реєстрація',
        'confirm_password' => 'Підтвердіть пароль',
        'confirm_password_text' => 'Це захищена зона. Будь ласка, підтвердіть свій пароль перед продовженням.',
        'confirm_password_text2' => 'Введіть свою електронну адресу, і ми надішлемо вам посилання для скидання пароля.',
        'reset_password' => 'Скинути пароль',
        'verify_email_text1' => "Дякуємо за реєстрацію! Перевірте свою електронну пошту, щоб підтвердити акаунт.\nЯкщо ви не отримали листа, можете надіслати ще один.",
        'verify_email_text2' => 'Нове посилання для підтвердження було надіслано на вашу електронну пошту.',
    ],

    'buttons' => [
        'login' => 'Увійти',
        'confirm' => 'Підтвердити',
        'send_reset_link' => 'Надіслати посилання для скидання',
        'register' => 'Зареєструватися',
        'reset_password' => 'Скинути пароль',
        'resend_verification_email' => 'Надіслати лист повторно',
    ],

    'inputs' => [
        'email' => 'Електронна пошта',
        'password' => 'Пароль',
        'first_name' => "Ім’я",
        'second_name' => 'Прізвище',
        'confirm_password' => 'Підтвердження пароля',
        'phone' => 'Телефон',
        'new_password' => 'Новий пароль',
        'confirm_new_password' => 'Підтвердіть новий пароль',
    ],

    'components' => [
        'logout' => 'Вийти',
        'login' => 'Увійти',
        'light_mode' => 'Світла тема',
        'dark_mode' => 'Темна тема',
    ],

    'companies' => [
        'my_companies' => 'Мої компанії',
    ],

    'pages' => [
        'chat' => 'Чат',
        'chat_text1' => "Тут буде доступний чат у реальному часі для учасників компанії.\n(Модуль чату в розробці)",
        'user_dashboard' => 'Панель користувача',
        'forum' => 'Форум',
        'forum_text1' => "У цьому розділі будуть обговорення спільноти та питання-відповіді між користувачами\n(сторінка в розробці)",
        'info_text1' => 'Проєкт Housing Company',
        'info_text2' => "Це PET-проєкт для управління об’єднаннями співвласників.\nПроєкт дозволяє мешканцям і адміністраторам керувати публікаціями,\nкористувачами та інформацією про компанії в одному місці.",
        'admin_panel' => 'Адмін-панель',
    ],

];
